** Rust in Linux

The Rust kernel source
[[~/oss_src/linux/rust/]]

Rust code in the kernel:
#+begin_src elisp
(find-dired "~/oss_src/linux/" "-name \"*.rs\"")
#+end_src

#+RESULTS:
| :%s |


It looks like the kernel uses the Rust `bindgen` tool to create bindings to certain kernel functions and data types, making them callable with Rust.

